#### [`repos-partners`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-KXhkA5MDBQUFWmir" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-KXhkA5MDBQUFWmir

Waiting for the plan to start...

Terraform v1.6.5
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5: Refreshing state... [id=cdktf-provider-mongodbatlas]
github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063: Refreshing state... [id=cdktf-provider-mongodbatlas-go]
github_repository.repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B: Refreshing state... [id=cdktf-provider-launchdarkly-go]
github_repository.repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314: Refreshing state... [id=cdktf-provider-launchdarkly]
github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]
github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE: Refreshing state... [id=398580580]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwineusername_EC15FA2E: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_USERNAME]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretalertprsslackwebhookurl_99526CD8: Refreshing state... [id=cdktf-provider-launchdarkly:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekey_43CD5933: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtoken_B076E5A5: Refreshing state... [id=cdktf-provider-launchdarkly:GH_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasGOGITHUBTOKEN_E643F160: Refreshing state... [id=cdktf-provider-launchdarkly:GO_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekeypassphrase_416CB401: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_repository_webhook.repospartners_cdktfproviderlaunchdarkly_repositorysetup_slackwebhook_9AD3D6AF: Refreshing state... [id=425871226]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenpassword_B811F8CB: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_PASSWORD]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenusername_6CBB637A: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_USERNAME]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnugetapikey_A8CFC2DD: Refreshing state... [id=cdktf-provider-launchdarkly:NUGET_API_KEY]
github_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB: Refreshing state... [id=BPR_kwDOJ_5BQc4CYBOl]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwinepassword_F4217409: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_PASSWORD]
github_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_automergelabel_0E78197D: Refreshing state... [id=cdktf-provider-launchdarkly:automerge]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnpmtoken_55C9B1E4: Refreshing state... [id=cdktf-provider-launchdarkly:NPM_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenstagingprofileid_919B2A41: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasPROJENGITHUBTOKEN_D014A00B: Refreshing state... [id=cdktf-provider-launchdarkly:PROJEN_GITHUB_TOKEN]
github_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_automergelabel_35291F2B: Refreshing state... [id=cdktf-provider-launchdarkly-go:automerge]
github_repository_webhook.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_slackwebhook_E7459C6F: Refreshing state... [id=425871230]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]
github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]
data.github_team.cdktf-team-cdktf: Read complete after 7s [id=6602018]
github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]
github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA: Refreshing state... [id=398580582]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]
github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]
github_team_repository.repospartners_cdktfproviderlaunchdarkly_repositorysetup_managingteam_B55490C8: Refreshing state... [id=6602018:cdktf-provider-launchdarkly]
github_team_repository.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_managingteam_7D3BC365: Refreshing state... [id=6602018:cdktf-provider-launchdarkly-go]
github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_noautocloselabel_A625C816 will be created
  + resource "github_issue_label" "repospartners_cdktfproviderlaunchdarkly_repositorysetup_noautocloselabel_A625C816" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-launchdarkly"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_noautocloselabel_F803EAB6 will be created
  + resource "github_issue_label" "repospartners_cdktfproviderlaunchdarklygo_repositorysetup_noautocloselabel_F803EAB6" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-launchdarkly-go"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_noautocloselabel_35667363 will be created
  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlas_repositorysetup_noautocloselabel_35667363" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-mongodbatlas"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_noautocloselabel_7636A486 will be created
  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_noautocloselabel_7636A486" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-mongodbatlas-go"
      + url        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*